text = '''Идеи для контента
Идеи для внешнего и емэйл-контента.

У инди проблемы с емэйл-рассылками в основном по одной причине - они не знают, о чем писать.
Из своей игры много инфоповодов не высосешь, а рассылать что-то нужно минимум 2-3 раза в неделю. Желательно писать что-то каждый день.

И здесь на помощь приходят идеи для контента.

Их можно генерить с помощью ИИ типа ЧатГПТ.

Здесь буду выкладывать свои идеи по генерации идей.

Алгоритм такой:

1. Выбираешь жанр кино, связанный с игрой. Я, допустим, выберу фантастику. Потому что другие жанры меня не цепляют, а зачем заниматься темой, которая не доставляет фан?
2. Ищешь в разных источниках идеи, связанные с выбранным жанром, чтобы на базе этих идей генерить контент для рассылок и соц. сетей.

Контент - это обычно истории или просто идеи.

Начну с источников:

Классика:
https://www.producthunt.com/search?q=movies

ИИ, специализирующийся на кино и тв:
https://www.mycelebs.com/deepsearch/'''
