

text = '''
Мышление письмом — это практика перевода своих мыслей в письменную форму.

То, чем я преимущественно занимаюсь в этом блоге, и, по мере сил, на работе.

Наконец нашёл время рассказать про эту штуку подробнее.

В определении важно каждое слово, как бы банально это не звучало:

Практика предполагает постоянство.

Существенная часть пользы мышления письмом происходит как раз от непрерывного применения, за счёт эмерджентного эффекта накопления письменных артефактов.

Но даже разовый акт формализации мыслей на бумаге принесёт пользу — попробуйте :-)

Перевод предполагает изменение формы подачи и организации информации. Если вы начнёте «дословно» записывать образы из головы, пользы будет мало. Перевод — ключевой элемент мышления письмом и о нём мы ещё поговорим.

Свои мысли — очевидная составляющая: если записывать не мысли, то это не мышление, если не свои, то это стенография.

Письменная форма — логичное уточнение. Удобно расширить понятие письменной формы с текста до диаграмм, графиков и любых других языков записи информации на материальных носителях. Даже до живописи.

Как и другие общие практики, а-ля «занятие спортом», мышление письмом не наносит один конкретный вид пользы. Вместо этого оно действует по множеству направлений, к сожалению, проявляя эффективность не моментально. Из-за этого сложно сходу и кратко объяснить крутость этой практики.

Не буду пытаться обмануть вселенную и расскажу долгим способом — отдельно про каждое направление.

Но начну с эвристики.

Каждая деятельность должна оставлять артефакт
Не могу сказать, что это и только это соображение подтолкнуло меня к мышлению письмом. Но, если память не изменяет, с его помощью я увидел чётко очерченную проблему в своей жизни деятельности — я много думал занимался (и занимаюсь) умственным трудом, но после этого труда часто не оставалось ничего. Надуманные мысли, принятые решения со временем размывались, растворялись в потоке сознания.

С материалистической точки зрения это очень здравая и простая идея.

Если мир полностью материален, подвластен причинно-следственным связям, то суть осмысленной деятельности в нём — создание артефактов. Будь то построенный дом, написанная книга, царапина на столе. То есть создание изменений в материальном мире, которые будут распространять своё влияние в нём за счёт причинно-следственных связей.

Если же вы подумали над чем-то, но никак не отразили результат мыслей в реальности, то считай этих умственных усилий и не было.

С формальной точки зрения, думая, вы меняете свойства нейронов в мозгу — какое-никакое изменение. Но это изменение сродни постройке песчаного замка перед прибоем. Придёт волна и от замка не останется ничего. Так и с незаписанными мыслями — пройдёт день-два и от них останутся куцые ошмётки.

Поэтому для человека с материалистическим мировоззрением должно быть логично переводить все свои стоящие мысли в постоянную форму. Исторически же так сложилось, что самая удобная стабильная форма для мыслей — текст.

Как я уже говорил, переносить мысли полезно хоть куда: в ролики Tiktok, нотную запись, мангу. Работать с такими записями будет сложнее, но всё равно полезно. Все следующие рассуждения можно смело распространять на эти и другие способы.

Поэтому альтернативным названием эссе можно считать Мышление артефактами.

Кстати, лично было бы интересно вести блог в виде манги, но это для меня запредельно сложно :-D

Вот теперь можно поговорить и о направлениях, по которым практика создания письменных артефактов наносит пользу.

Верификация ментальных моделей
Каждый акт сложного мышление связан с моделями. Вы либо изменяете их, либо создаёте новые, либо используете для изменения или создания других моделей. Утрируя, каждая мысль, в некотором роде, — модель чего-то.

Модели в голове хранятся в виде образов — расплывчатом, неточном уникальном для мозга формате. И оперируем мы в основном образами.

Можно заставить себя мыслить на формальном языке (например, логическими высказываниями), но это очень энергозатратно, долго и полностью мышление вы на эти рельсы не переведёте. Мы живём в неточном мире в условиях неполноты информации о нём, что естественным образом обязывает использовать неточные штуки.

Когда вы переводите мысли на бумагу, в артефакт, вы меняете формат их представления, равно как и правила описания модели. Например, письменный текст заставляет использовать предопределённый словарь понятий (собравший опыт всех носителей языка), выстраивать высказывания в удобном порядке, контролировать их согласованность, etc.

По сути, вы занимаетесь формализацией — переводом знаний из менее формальной формы (образов) в более формальную (текст).

В процессе этого вы делаете две важных штуки.

Во-первых, явно проводите через сознание все аспекты ментальной модели. Чтобы записать мысль, нам приходится пройтись по каждому её аспекту, по всем неявным допущениям и неопределённым понятиям. Это позволяет выявить множество ошибок.

Поэтому справедливо утверждение: что не записано, то не осознано.

Делать эту работу сложно, ей надо учиться на практике. И это, скорее всего, основная причина, почему большинство людей не умеют в письменную речь. Нет практики — нет умения.

Во-вторых, вы строите модель альтернативную вашей ментальной модели. А если у нас есть несколько моделей, мы можем их сравнивать, определять отличия и общие части. То есть мы может уточнить каждую из наших моделей за счёт сравнения с другой.

О верификации моделей я уже писал подробно. Ссылки на посты можно найти в эссе Жизнь и работа с моделями.

Уточнения начнутся как только вы приступите к записи первого предложения. И они будет происходить во время всего процесса перевода мыслей в текст. Даже когда текст, как может показаться, закончен, имеет смысл перечитывать его как цельную сущность, сравнивать с содержимым вашей головы и исправлять: текст, мысли или и то и другое.

Результатом такой формализации, со временем, станет ваша личная внешняя база знаний — запись вашей картины мира — часть экзокортекса.

База знаний
Люди забывают всё. До сих пор не понятно баг это или фича, но таково положение дел.

Некоторые вещи забывать не страшно и даже полезно. Некоторые — неудобно, но не критично — всегда можно восстановить. А некоторые — лучше бы не забывать.

Забывчивость несёт проблемы:

Замедляет принятие решений — забытое надо долго вспоминать или искать во внешних источниках.
Мешает отслеживать реальную картину мира — мы вечно забываем важные нюансы. А неточные данные на входе неточной модели приводят к плохим предсказаниям.
Мой «любимый» рабочий пример забывчивости — стабильная невозможность людей вспомнить причины и следствия решений, принятых полгода назад и более. Между нами говоря, на мой взгляд, это лютая дичь, но я встречал это буквально везде. В итоге такой забывчивости народ начинает бегать кругами, обсуждая одни и те же вопросы.

Забывчивость ослабляет способность к адаптации, а значит — конкурентноспособность. Сейчас же будущее каждого человека зависит как раз от качества и скорости принятия решений.

Появляющаяся «сама-собой», как следствие практики, база знаний сохраняет ваши мысли-модели и тем самым увеличивает качество скорость принятия решений.

Если ваш мозг работает не в холостую (я надеюсь на это), то идеи постоянно роятся у вас в голове, отвлекают от актуальных задач, раздражают постоянными напоминаниями о недодуманном, недоделанном.

Внешняя база знаний разгружает мозг. Ему не приходится постоянно прокручивать одни и те же мысли. Как только вы начнёте переносить их из головы на бумагу, вам станет легче и свободнее думать.

Захламлённость идеями была одной из причин моего ухода в творческий отпуск. Эффект от разгрузки головы через блог оказался потрясающим.

Конечно, не получится вынести все модели из головы. Но можно оставлять в ней только их упрощённые версии, оптимизированные под рутинные задачи. Если же встретится сложная задача, полную модель всегда можно поднять из записей.

Только этим личная база знаний приносит заметную пользу. Но её эффективность можно кратно увеличить, если сделать базу публичной.

Публичная база знаний
Когда мы делаем публичную работу, мы начинаем больше стараться. Это не про всех, но скорее всего про вас :-)

Хорошо выполненная формализация мыслей ведёт к более качественным моделям.

Люди будут сравнивать ваши модели со своими и давать обратную связь, рассказывая о своей картине мира. Больше моделей для верификации поможет найти больше несоответствий с реальностью, а значит ваши модели станут ещё лучше. И не только ваши, но и ваших читателей!

Это действенный способ потихоньку, малыми шагами делать мир лучше.

Как бонус, публичная база знаний сильно упрощает дискуссии. Дать ссылку на готовые рассуждения быстрее и проще, чем выписывать их каждый раз заново. По сравнению с извлечением знаний из головы, ваши аргументы будут полнее, чётче, убедительнее и, что особенно важно, стабильнее.

«Личный бренд», если позволите, тоже неплохо развивается от подобной деятельности.

А лично я с интересом жду момента, когда мои дети, надеюсь, будут читать эти записи :-D Должно быть забавно.

Тренировка коммуникативных навыков
Не самый заметный аспект мышления письмом, но тоже важный.

Переводя мысли в письменные артефакты, вы тренируетесь излагать идеи другим людям. Даже если пишете в стол (то есть себе будущему).

Без навыков такого изложения нынче ничего масштабного не сделать. Да и просто ничего не сделать.

Сложности
Есть, конечно, и они.

Писать — сложно. Это мы ещё со школы знаем. Орфография, пунктуация, грамматика и прочие штуки просто не даются. К счастью мы живём в XXI веке и у каждого под рукой автоматизированные редакторы.

Я, например, пользуюсь проверкой орфографии Яндекса и Главредом — инструментом для автоматической вычитки текстов на предмет сложности и уместности выражений.

Тяжело переносить мысли на бумагу. Особенно поначалу. Тут главное не сдаваться, может быть, почитать пару книг в тему. Не могу порекомендовать ничего конкретного, но знаю, что есть хорошие.

И, конечно, мышление письмом занимает много времени. С практикой процесс ускоряется, но моментальным не становится. Журналистское образование в этом должно как-то помогать, но у меня его нет.

В начале практики я мог тратить неделю на большие посты (ладно, они действительно были большими). Сейчас написание эссе может занимать от 4 часов до пары дней. В зависимости от сложности и вдохновения. При этом бывают перерывы в неделю и более. Поэтому стараюсь писать о том, что зудит больше всего — тогда пишется быстрее. На этот пост, например, в сумме ушло часов 6-8, разбитых на 2 дня.

Трату времени я не считаю проблемой. Скорее неизбежным злом. Помните: каждая деятельность должна оставлять артефакт. Лучше потратить время на запись нескольких мыслей, чем на обдумывание многих, если через месяц от них ничего не останется.

Кроме того, можно немного сжульничать.

Если продумывается новая тема, то можно думать и писать одновременно. Тем самым вы не только сэкономите время, но и замкнёте быструю петлю обратной связи верификации письменной и ментальной модели.

Я бы даже сказал, что эта практика — эталонное мышление письмом.
'''
