
text = '''
«WTF?» или «Гид по бизнес-моделям будущего» — книга авторства Тима О’Рейли — основателя издательства O’Reilly, книги которого знакомы всем технарям. Содержательно нечто среднее между сборником баек и манифестом автора о правильном будущем.

В отличии от Фрикономики, байки иллюстрируют мысли автора, а не являются основной ценностью книги. К тому же они правильно подобраны, объединены общей темой, целью и сопровождены глубоким разбором от автора.

Книга отражает взгляд Тима на историю развития технологий и технологических компаний в США, через призму подрывных технологий. Название книги WTF? выбрано как типичная реакция на изменения, которые приносят эти технологии.

Читать советую технарям и управленцам, в том числе политикам. Первые встретят много знакомых имён и событий, вторые получат хорошие инструменты для взгляда на мир и прогнозирования, и vice versa.

Также книга будет интересна людям, которые интересуются проявлениями эволюции вне биологии.

Тим рассуждает о множестве вещей, но стержнем повествования являются три темы:

Государство и бизнес как платформы, формируемые подрывными технологиями.
Влияние функции приспособленности на свойства платформы и поведение её агентов.
Почему занимаясь бизнесом надо помнить про этику.
Тезисы
Кратко и целостно передать позицию автора у меня не получится, так как изложение в книги многостороннее и сильносвязанное. Ключевые темы раскрываются не последовательно, а параллельно.

Поэтому перескажу упрощённо, через последовательность тезисов.

Мир изменяют, в числе прочего, подрывные технологии — штуки, которые при массовом распространении меняют правила игры. Обычно это сопровождается появлением новых рынков и умиранием старых. Хорошим примером подрывной технологии будет цифровая фотография, «убившая» Kodak.

Для развития подрывной технологии первым делом необходим нишевый рынок, на котором она наберёт силу, чтобы ворваться на большие рынки уже со своими правилами. Фактически, развитие подрывной технологии — это выращивание «дублирующей» системы с перспективой обновления на неё.

Большие компании часто пропускают такие технологии и уступает место молодым компаниям. Следить, соответственно, надо за небольшими компаниями, которые работают на фронтире технологий.

Правильно сыграв карту подрывной технологии, компания на её основе может создать платформу — инструмент, которым будут пользоваться более мелкие компании и обычные люди. Назовём участников платформы агентами. Примером платформ могут стать: поиск Google, магазин и облачная инфраструктура Amazon, магазин самоделок etsy.com, любая крупная социальная сеть, Uber.

Платформа предоставляет инструменты для создателей и площадку для обмена между создателями и потребителями. Тем самым, деятельность платформы оказывает эффект на множество участников рынка.

«Правильно» построенная платформа наносит обществу пользу даже большую, чем получаемая платформой прибыль.

В этом контексте государство также можно считать платформой. Следовательно взаимодействовать с ним и управлять им можно и нужно по тем же принципам.

Платформа имеет огромное влияние на своих агентов. Изменения в правилах её функционирования могут обогащать и банкротить пользователей. По цепочке экономических связей влияние платформы распространяется далеко за её границы.

Если деятельность платформы приносит пользу агентам, то они способствуют привлечению новых пользователей платформы, что увеличивает её эффективность. Получается положительная обратная связь, которая идёт всем на пользу. Редкий случай, кстати.

Как и все сложные штуки, платформа подчиняется законам эволюции. Её работа, а значит и влияние на общество, зависят от оценочной функции, которую применяют владельцы для настройки эффективной работы своего бизнеса.

Если оценочная функция «правильная», платформа будет развиваться в благоприятную для себя и общества сторону.

Поскольку платформа существует не в вакууме, а в высококонкурентной среде, подобрать «правильную» оценочную функцию сложно. Но в этом и заключается «секрет» управления платформой.

Пример плохой оценочной функции — оценка эффективности управление компанией на основе суммы выплачиваемых дивидендов, что приводит к вымывании денег из реального сектора и ставит во главу угла не влияние компании на материальный мир, а использование финансовых уловок.

В подобном контексте, управление государством сводится к тому, чтобы давать гражданам удобные инструменты для взаимодействия и выбирать правильные оценочные функции для анализа деятельности государственных структур.

Принципы подрывных технологий
В последней главе Тим формирует несколько принципов подрывных технологий. Я бы не назвал их универсальными, скорее они актуальны именно на текущий момент. Тем более, их совсем необязательно распространять на обычные технологии, хотя я бы распространил.

Глава так и называется «Работа над чем-то важным».

Так как в конце книги автор делает сильный уклон в этику, пояснения будут с толикой моей отсебятины. Добавлю приземлённости, чтобы не вдаваться в пересказывание длинных связей между этическими решениями и материальным миром.

Также я слегка переиначил формулировки, чтобы сделать их стилистически едиными.

Работайте над чем-то, что для вас важнее денег
Деньги — это инструмент, он необходим, но работать, только чтобы инструмента было много, нелогично.

Деньги всегда должны быть нужны для чего-то конкретного. Эта штука и должна быть явной целью вашей деятельности. Выбор целью зарабатывание денег, приведёт к использованию неверной оценочной функции и в лучшем случае вы ничего не измените в мире.

Создавайте большую ценность, чем получаете
Технологии, меняющие мир, как ни парадоксально, должны быть в состоянии менять мир.

Ваша деятельность должна «обогащать» других эффективнее, чем вас. Проще всего добиться этого, если вы создаёте небольшую выгоду для множества мелких агентов.

Такая стратегия способствует формированию платформы за счёт возникновения положительной обратной связи между вами и вашими агентами.

Если вы обираете клиентов или работаете на обогащение пары «денежных мешков», то платформа у вас не возникнет по определению.

Позаботьтесь о будущем
Как только ваша деятельность примет заметные размеры, её результаты начнут распространяться по невообразимому количеству путей. Её эффекты станут заметны в отдалённых от вас областях.

Необходимо следить, чтобы эти эффекты были положительными или нейтральными, иначе не будет положительной обратной связи. Поэтому надо мыслить стратегически, планировать на широком горизонте и исследовать влияние вашей деятельности на всех участников рынка.

Стремитесь завтра стать лучше, чем сегодня
Меняйте себя и мир под лучшую модель реальности, а не себя и модель под реальность. Это не всегда возможно, но если постоянно подстраиваться под мир, ничего нового создать не получится.

Разрабатывайте действенные стратегии
В этом пункте автор рассказывает про сценарное планирование.

Я не понял, почему именно про него, но суть в том, что стратегия должна быть качественной.

Я бы сказал, стратегия должна быть как хорошая теория: полной, непротиворечивой, фальсифицируемой, обладать предсказательной силой и так далее.

Ищите новую работу, а не рабочие места в старой
Один из самых интересных пунктов.

По вопросу потери рабочих мест Тим проходится на всём протяжении книги. Его итоговая идея заключается в следующем: нужно думать не как сохранить существующие рабочие места, а какую новую работу необходимо выполнять, чтобы достичь поставленных целей.

Практика показывает, что новые профессии (и новые рабочие места) появляются не медленнее, чем устаревают рабочие места старых укладов.

Изменения неизбежны, не стоит пытаться силой сохранять устаревающие профессии. Вместо этого необходимо искать новые возможности, новую работу на фронтире технологий. И способствовать переходу туда работников, конечно.

Всё в наших руках
Не технологии приносят вред, а наши решения о том, как их применять. Наше будущее, будущее общества зависит от того, какие решения мы принимаем сейчас.

Поэтому надо следить за собой, быть осторожным ;-)

Всякое интересное
Тим, по-видимому, демократ. Любит Обаму, не любит Трампа. Считает деятельность «Уолл Стрит» вредной и что в американские выборы 2016 вмешивались, возможно русские.

Вы узнаете больше об опционах, дивидендах, работе рынка и изменениях в нём за последние десятилетия. Посмотрите на акции и опционы, как на «суперденьги», которые усиливают разрыв между очень богатыми и всеми остальными.

Автор положительно отзывается о книге Злые самаритяне, о которой я уже писал.

Также Тим упоминает сервис pol.is — предназначенный для поиска консенсуса в больших группах людей с помощью чего-то вроде управляемой эволюции мемов. Я пока до него не добрался, но обязательно посмотрю.
'''
